/************************************版权所有(c)****************************************
* 版权所有(c), 2012-2013, XXXXXXXXXXXX, 保留所有权
* 文件名      ：Crc32EthernetSTM32.c
* 作者        ：XXXX
* 版本        ：V 1.0
* 日期        ：2015-03-13
* 功能描述    ：
* 备注        ：
* 主要函数列表：
* 修改记录    ：
  日      期          版本          修改人          修改内容
  2015-03-13          1.0           XXXX            创建文件
****************************************************************************************/

/* 调试部分开关 -----------------------------------------------------------------------*/

/* 包含文件 ---------------------------------------------------------------------------*/
#include "utilities.h"
#include "CoreInclude.h"

/* 宏定义 -----------------------------------------------------------------------------*/

/* 结构类型定义 -----------------------------------------------------------------------*/

/* 原型声明部分 -----------------------------------------------------------------------*/

/* 全局变量声明 -----------------------------------------------------------------------*/

/* 静态变量定义 -----------------------------------------------------------------------*/

/****************************************************************************************
* 函数名称: crc32_ethernet_block()
* 功能描述: 文件下载CRC校验
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 校准结果
****************************************************************************************/
uint32 crc32_ethernet_block(const uint8 *const data, uint32 length)
{
	uint32 	count;
	uint32 	check;
	char	complement[4] = {0, 0, 0, 0};
	BOOL	has_remainder;
	char	remainder;
	uint32	cursor;
	
	has_remainder = length&0x03?TRUE:FALSE;

	if(has_remainder)
	{
		count 		= 0;
		remainder 	= length&0x03;
		cursor 		= length&0xFFFFFFFC;

		while(count < remainder)
		 	complement[count++] = data[cursor++];
	} 

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_CRC, ENABLE);
	CRC_ResetDR();

	check = CRC_CalcBlockCRC((uint32_t*)data, length>>2);
	if(has_remainder)
		check = CRC_CalcCRC(*(uint32*)complement);

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_CRC, DISABLE); 

	return check;	 
}

/*******************************版权所有(c)**************END OF FILE********************/
