/************************************版权所有(c)****************************************
* 版权所有(c), 2012-2013, 成都华富科技有限公司, 保留所有权  
* 文件名      ：CoreInclude.h
* 作者        ：周 潘
* 版本        ：V 1.0
* 日期        ：2014/11/08
* 功能描述    ：CPU需要内核头文件
* 备注        ：
* 主要函数列表：
* 修改记录    ：
  日      期          版本          修改人          修改内容  
  2014/11/08          1.0           周潘            创建文件
****************************************************************************************/

/* 防止头文件重复包含 -----------------------------------------------------------------*/
#ifndef __CoreInclude_H__
#define __CoreInclude_H__

/* 调试部分开关 -----------------------------------------------------------------------*/

/* 外部定义 ---------------------------------------------------------------------------*/
#ifdef    CORE_INCLUDE_MODULE
#define   CORE_INCLUDE_EXT
#else
#define   CORE_INCLUDE_EXT  extern
#endif

/* 包含文件 ---------------------------------------------------------------------------*/
#ifdef STM32F1XX
#include "stm32f10x.h"
#include "core_cm3.h"
#include "stm32f10x_conf.h"
#include "stm32f10x_it.h"
#endif //:~STM32F1XX

#ifdef STM32F0XX
#include "stm32f0xx.h"
#include "core_cm0.h"
#include "stm32f0xx_conf.h"
#include "stm32f0xx_it.h"
#endif //:~STM32F0XX

#ifdef STM32F4XX
#include "stm32f4xx.h"
#include "core_cm4.h"
#include "stm32f4xx_conf.h"
#include "stm32f4xx_it.h"
#endif //:~STM32F4XX

/* 宏定义 -----------------------------------------------------------------------------*/

/* 结构类型定义 -----------------------------------------------------------------------*/

/* 原型声明部分 -----------------------------------------------------------------------*/

#endif /* __CoreInclude_H__ */
/*******************************版权所有(c)**************END OF FILE********************/
