/************************************版权所有(c)****************************************
* 版权所有(c), 2012-2013, XXXXXXXX公司, 保留所有权
* 文件名      ：STM32Fxxx_RTC.h
* 作者        ：XXXXXX
* 电子邮箱    ：XXXXXX
* 版本        ：V1.0.0.0
* 日期        ：2017-10-06
* 功能描述    ：
* 备注        ：
* 主要函数列表：
* 修改记录    ：
  日      期          版本          修改人          修改内容
  2017-10-06          1.0           XXXXXXXX        创建文件	
****************************************************************************************/

/* 防止头文件重复包含 -----------------------------------------------------------------*/
#ifndef __STM32FXXX_RTC_H__
#define __STM32FXXX_RTC_H__

#ifdef __cplusplus
 extern "C" {
#endif

/* 调试部分开关 -----------------------------------------------------------------------*/

/* 外部定义 ---------------------------------------------------------------------------*/
#ifdef    STM32FXXX_RTC_MODULE
#define   STM32FXXX_RTC_EXT
#else
#define   STM32FXXX_RTC_EXT  extern
#endif

/* 包含文件 ---------------------------------------------------------------------------*/
#include "NewTYpe.h"

/* 宏定义 -----------------------------------------------------------------------------*/

/* 结构类型定义 -----------------------------------------------------------------------*/

/* 原型声明部分 -----------------------------------------------------------------------*/
STM32FXXX_RTC_EXT BOOL STM32Fxxx_RTCInit(void);
STM32FXXX_RTC_EXT BOOL BSP_RTCSet(RTCTime *rtc);
STM32FXXX_RTC_EXT BOOL BSP_RTCGet(RTCTime *rtc);


#ifdef __cplusplus
}
#endif
#endif /* __STM32FXXX_RTC_H__ */
/*******************************版权所有(c)**************END OF FILE********************/
